# Это пример сценария Python.
# Ctrf + Alt + A Добавить файл (выделить) в отслеживаемые add ./
# Нажмите Shift+F10, чтобы выполнить его или заменить его своим кодом.
# Нажмите Double Shift, чтобы искать везде классы, файлы, окна инструментов, действия и настройки.


def print_hi(name):
    # Используйте точку останова в строке кода ниже для отладки вашего сценария.
    print(f'Hi, {name}') # Нажмите Ctrl+F8, чтобы переключить точку останова.


# Нажмите зеленую кнопку в стоке, чтобы запустить скрипт.
if __name__ == '__main__':
    print_hi('PyCharm')

# См. справку по PyCharm по адресу https://www.jetbrains.com/help/pycharm/.

