# Задача 32: Определить индексы элементов массива (списка),значения которых принадлежат заданному диапазону
# (т.е. не меньше заданного минимума и не больше заданного максимума)
# Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]


str_arr = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
mini = 7
maxi = 10
indexes_arr = []
for i, pivot in enumerate(str_arr):
    if mini <= pivot <= maxi:
        indexes_arr.append(i)

print("Вывод:", indexes_arr, sep='\n')



