# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе
# они сделали S журавликов. Сколько журавликов сделал каждый
# ребенок, если известно, что Петя и Сережа сделали одинаковое
# количество журавликов, а Катя сделала в два раза больше журавликов,
# чем Петя и Сережа вместе?
s = int(input())
k = 0
p = 0
c = 0
if p == c:
    print(f"Петя сделал {s // 6} журавлик(а), Катя сделала {s * 2 // 3} журавликов, Сергей сделал {s // 6} журавлик(а)")
